app/views/arts/index.html.erb

        <% if art.photos.first %>
          <%= link_to image_tag(art.photos.first.art_photo), art_path(art), class: 'index-photo' %>
---
SELECT "arts".* FROM "arts"  ORDER BY "arts"."created_at" DESC