app/controllers/arts_controller.rb

SELECT "arts".* FROM "arts"  ORDER BY id DESC
---
  def index
    @arts = Art.all.order("id ASC")

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT 1  [["id", 5]]
---
  def show
    @art = Art.find(params[:id])

INSERT INTO "arts" ("name", "location", "description", "category", "artist") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Sad Man"], ["location", "Boston, MA"], ["description", "A very sad portrait"], ["category", "Mural"], ["artist", "Michelangelo"]]
---
  def create
    @art = Art.new(art_params)
    if @art.save

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @art = Art.find(params[:id])

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "arts" SET "artist" = $1 WHERE "arts"."id" = $2  [["artist", "Another Artist"], ["id", 13]]
---
  def update
    @art = Art.find(params[:id])
    if @art.update_attributes(art_params)

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "arts" WHERE "arts"."id" = $1  [["id", 4]]
---
  def destroy
    @arts = Art.all.order("id ASC")
    @art = Art.find(params[:id])
    @art.destroy